app/Models/OrderModel.php

SELECT *
FROM `order`
---
    public function getOrder($slug = false)
    {
        if ($slug === false) {
            return $this->findAll();