app/Models/Order_detailModel.php

SELECT *
FROM `order_detail`
---
    public function getOrderde($slug = false)
    {
        if ($slug === false) {
            return $this->findAll();