app/Models/ProductModel.php

    public function getProduct($slug = false)
    {
        if ($slug === false) {
            return $this->findAll();
        }
        return $this->where(['product_id' => $slug])->first();
---
SELECT *
FROM `product`
SELECT *
FROM `product`
WHERE `product_id` = '60'
 LIMIT 1

    public function delProduct($slug = false)
    {
        if ($slug === false) {
            return false;
        }
        $this->where('product_id', $slug);
        return $this->delete();
---
DELETE FROM `product`
WHERE `product_id` = '60'

    public function editProduct($slug = false,$post=false)
    {
        if ($slug === false) {
            return false;
        }
        $this->set('product_name',$post['product_name']);
        $this->set('product_price',$post['product_price']);
        $this->set('product_quantity',$post['product_quantity']);
        if(isset($post['img'])){
            $this->set('product_img',$post['img']);
        }

        $this->set('product_detail',$post['product_detail']);
        $this->set('product_category_id',$post['product_category_id']);

        $this->where('product_id', $slug);
        return $this->update();
---
UPDATE `product` SET `product_name` = 'wdww', `product_price` = '13213', `product_quantity` = '12', `product_detail` = '52525', `product_category_id` = '22'
WHERE `product_id` = '60'